espressif/esp-idf/components/soc/esp32c5/register/soc/cache_reg.h
/** CACHE_L1_CACHE_PRELOAD_CTRL_REG register
 *  L1 Cache  preload-operation control register
 */
#define CACHE_L1_CACHE_PRELOAD_CTRL_REG (DR_REG_CACHE_BASE + 0xd4)
/** CACHE_L1_CACHE_PRELOAD_ENA : R/W/SC; bitpos: [0]; default: 0;
 *  The bit is used to enable preload operation on L1-Cache. It will be cleared by
 *  hardware automatically after preload operation is done.
 */
#define CACHE_L1_CACHE_PRELOAD_ENA    (BIT(0))
#define CACHE_L1_CACHE_PRELOAD_ENA_M  (CACHE_L1_CACHE_PRELOAD_ENA_V << CACHE_L1_CACHE_PRELOAD_ENA_S)
#define CACHE_L1_CACHE_PRELOAD_ENA_V  0x00000001U
#define CACHE_L1_CACHE_PRELOAD_ENA_S  0
/** CACHE_L1_CACHE_PRELOAD_DONE : RO; bitpos: [1]; default: 1;
 *  The bit is used to indicate whether preload operation is finished or not. 0: not
 *  finished. 1: finished.
 */
#define CACHE_L1_CACHE_PRELOAD_DONE    (BIT(1))
#define CACHE_L1_CACHE_PRELOAD_DONE_M  (CACHE_L1_CACHE_PRELOAD_DONE_V << CACHE_L1_CACHE_PRELOAD_DONE_S)
#define CACHE_L1_CACHE_PRELOAD_DONE_V  0x00000001U
#define CACHE_L1_CACHE_PRELOAD_DONE_S  1
/** CACHE_L1_CACHE_PRELOAD_ORDER : R/W; bitpos: [2]; default: 0;
 *  The bit is used to configure the direction of preload operation. 0: ascending, 1:
 *  descending.
 */
#define CACHE_L1_CACHE_PRELOAD_ORDER    (BIT(2))
#define CACHE_L1_CACHE_PRELOAD_ORDER_M  (CACHE_L1_CACHE_PRELOAD_ORDER_V << CACHE_L1_CACHE_PRELOAD_ORDER_S)
#define CACHE_L1_CACHE_PRELOAD_ORDER_V  0x00000001U
#define CACHE_L1_CACHE_PRELOAD_ORDER_S  2
/** CACHE_L1_CACHE_PRELOAD_RGID : HRO; bitpos: [6:3]; default: 0;
 *  The bit is used to set  the gid of l1 cache preload.
 */
#define CACHE_L1_CACHE_PRELOAD_RGID    0x0000000FU
#define CACHE_L1_CACHE_PRELOAD_RGID_M  (CACHE_L1_CACHE_PRELOAD_RGID_V << CACHE_L1_CACHE_PRELOAD_RGID_S)
#define CACHE_L1_CACHE_PRELOAD_RGID_V  0x0000000FU
#define CACHE_L1_CACHE_PRELOAD_RGID_S  3

/** CACHE_L1_DCACHE_PRELOAD_ADDR_REG register
 *  L1 Cache  preload address configure register
 */
#define CACHE_L1_DCACHE_PRELOAD_ADDR_REG (DR_REG_CACHE_BASE + 0xd8)
/** CACHE_L1_CACHE_PRELOAD_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Those bits are used to configure the start address of preload on L1-Cache, which
 *  should be used together with L1_CACHE_PRELOAD_SIZE_REG
 */
#define CACHE_L1_CACHE_PRELOAD_ADDR    0xFFFFFFFFU
#define CACHE_L1_CACHE_PRELOAD_ADDR_M  (CACHE_L1_CACHE_PRELOAD_ADDR_V << CACHE_L1_CACHE_PRELOAD_ADDR_S)
#define CACHE_L1_CACHE_PRELOAD_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_CACHE_PRELOAD_ADDR_S  0

/** CACHE_L1_DCACHE_PRELOAD_SIZE_REG register
 *  L1 Cache  preload size configure register
 */
#define CACHE_L1_DCACHE_PRELOAD_SIZE_REG (DR_REG_CACHE_BASE + 0xdc)
/** CACHE_L1_CACHE_PRELOAD_SIZE : R/W; bitpos: [13:0]; default: 0;
 *  Those bits are used to configure the size of the first section of prelock on
 *  L1-Cache, which should be used together with L1_CACHE_PRELOAD_ADDR_REG
 */
#define CACHE_L1_CACHE_PRELOAD_SIZE    0x00003FFFU
#define CACHE_L1_CACHE_PRELOAD_SIZE_M  (CACHE_L1_CACHE_PRELOAD_SIZE_V << CACHE_L1_CACHE_PRELOAD_SIZE_S)
#define CACHE_L1_CACHE_PRELOAD_SIZE_V  0x00003FFFU
#define CACHE_L1_CACHE_PRELOAD_SIZE_S  0

/** CACHE_L1_ICACHE2_AUTOLOAD_CTRL_REG register
 *  L1 instruction Cache 2 autoload-operation control register
 */
#define CACHE_L1_ICACHE2_AUTOLOAD_CTRL_REG (DR_REG_CACHE_BASE + 0x108)
/** CACHE_L1_ICACHE2_AUTOLOAD_ENA : R/W; bitpos: [0]; default: 0;
 *  The bit is used to enable and disable autoload operation on L1-ICache2.  1: enable,
 *  0: disable.
 */
#define CACHE_L1_ICACHE2_AUTOLOAD_ENA    (BIT(0))
#define CACHE_L1_ICACHE2_AUTOLOAD_ENA_M  (CACHE_L1_ICACHE2_AUTOLOAD_ENA_V << CACHE_L1_ICACHE2_AUTOLOAD_ENA_S)
#define CACHE_L1_ICACHE2_AUTOLOAD_ENA_V  0x00000001U
#define CACHE_L1_ICACHE2_AUTOLOAD_ENA_S  0
/** CACHE_L1_ICACHE2_AUTOLOAD_DONE : RO; bitpos: [1]; default: 1;
 *  The bit is used to indicate whether autoload operation on L1-ICache2 is finished or
 *  not. 0: not finished. 1: finished.
 */
#define CACHE_L1_ICACHE2_AUTOLOAD_DONE    (BIT(1))
#define CACHE_L1_ICACHE2_AUTOLOAD_DONE_M  (CACHE_L1_ICACHE2_AUTOLOAD_DONE_V << CACHE_L1_ICACHE2_AUTOLOAD_DONE_S)
#define CACHE_L1_ICACHE2_AUTOLOAD_DONE_V  0x00000001U
#define CACHE_L1_ICACHE2_AUTOLOAD_DONE_S  1
/** CACHE_L1_ICACHE2_AUTOLOAD_ORDER : R/W; bitpos: [2]; default: 0;
 *  The bit is used to configure the direction of autoload operation on L1-ICache2. 0:
 *  ascending. 1: descending.
 */
#define CACHE_L1_ICACHE2_AUTOLOAD_ORDER    (BIT(2))
#define CACHE_L1_ICACHE2_AUTOLOAD_ORDER_M  (CACHE_L1_ICACHE2_AUTOLOAD_ORDER_V << CACHE_L1_ICACHE2_AUTOLOAD_ORDER_S)
#define CACHE_L1_ICACHE2_AUTOLOAD_ORDER_V  0x00000001U
#define CACHE_L1_ICACHE2_AUTOLOAD_ORDER_S  2
/** CACHE_L1_ICACHE2_AUTOLOAD_TRIGGER_MODE : R/W; bitpos: [4:3]; default: 0;
 *  The field is used to configure trigger mode of autoload operation on L1-ICache2.
 *  0/3: miss-trigger, 1: hit-trigger, 2: miss-hit-trigger.
 */
#define CACHE_L1_ICACHE2_AUTOLOAD_TRIGGER_MODE    0x00000003U
#define CACHE_L1_ICACHE2_AUTOLOAD_TRIGGER_MODE_M  (CACHE_L1_ICACHE2_AUTOLOAD_TRIGGER_MODE_V << CACHE_L1_ICACHE2_AUTOLOAD_TRIGGER_MODE_S)
#define CACHE_L1_ICACHE2_AUTOLOAD_TRIGGER_MODE_V  0x00000003U
#define CACHE_L1_ICACHE2_AUTOLOAD_TRIGGER_MODE_S  3
/** CACHE_L1_ICACHE2_AUTOLOAD_SCT0_ENA : R/W; bitpos: [8]; default: 0;
 *  The bit is used to enable the first section for autoload operation on L1-ICache2.
 */
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT0_ENA    (BIT(8))
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT0_ENA_M  (CACHE_L1_ICACHE2_AUTOLOAD_SCT0_ENA_V << CACHE_L1_ICACHE2_AUTOLOAD_SCT0_ENA_S)
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT0_ENA_V  0x00000001U
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT0_ENA_S  8
/** CACHE_L1_ICACHE2_AUTOLOAD_SCT1_ENA : R/W; bitpos: [9]; default: 0;
 *  The bit is used to enable the second section for autoload operation on L1-ICache2.
 */
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT1_ENA    (BIT(9))
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT1_ENA_M  (CACHE_L1_ICACHE2_AUTOLOAD_SCT1_ENA_V << CACHE_L1_ICACHE2_AUTOLOAD_SCT1_ENA_S)
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT1_ENA_V  0x00000001U
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT1_ENA_S  9
/** CACHE_L1_ICACHE2_AUTOLOAD_RGID : R/W; bitpos: [13:10]; default: 0;
 *  The bit is used to set  the gid of l1 icache2 autoload.
 */
#define CACHE_L1_ICACHE2_AUTOLOAD_RGID    0x0000000FU
#define CACHE_L1_ICACHE2_AUTOLOAD_RGID_M  (CACHE_L1_ICACHE2_AUTOLOAD_RGID_V << CACHE_L1_ICACHE2_AUTOLOAD_RGID_S)
#define CACHE_L1_ICACHE2_AUTOLOAD_RGID_V  0x0000000FU
#define CACHE_L1_ICACHE2_AUTOLOAD_RGID_S  10

