espressif/esp-idf/components/soc/esp32c5/register/soc/cache_reg.h
/** CACHE_L1_CACHE_ACS_FAIL_INT_CLR_REG register
 *  L1-Cache Access Fail Interrupt clear register
 */
#define CACHE_L1_CACHE_ACS_FAIL_INT_CLR_REG (DR_REG_CACHE_BASE + 0x16c)
/** CACHE_L1_ICACHE2_FAIL_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_FAIL_INT_CLR    (BIT(2))
#define CACHE_L1_ICACHE2_FAIL_INT_CLR_M  (CACHE_L1_ICACHE2_FAIL_INT_CLR_V << CACHE_L1_ICACHE2_FAIL_INT_CLR_S)
#define CACHE_L1_ICACHE2_FAIL_INT_CLR_V  0x00000001U
#define CACHE_L1_ICACHE2_FAIL_INT_CLR_S  2
/** CACHE_L1_CACHE_FAIL_INT_CLR : WT; bitpos: [4]; default: 0;
 *  The bit is used to clear interrupt of access fail that occurs in L1-DCache due to
 *  cpu accesses L1-DCache.
 */
#define CACHE_L1_CACHE_FAIL_INT_CLR    (BIT(4))
#define CACHE_L1_CACHE_FAIL_INT_CLR_M  (CACHE_L1_CACHE_FAIL_INT_CLR_V << CACHE_L1_CACHE_FAIL_INT_CLR_S)
#define CACHE_L1_CACHE_FAIL_INT_CLR_V  0x00000001U
#define CACHE_L1_CACHE_FAIL_INT_CLR_S  4

/** CACHE_L1_CACHE_ACS_FAIL_INT_RAW_REG register
 *  Cache Access Fail Interrupt raw register
 */
#define CACHE_L1_CACHE_ACS_FAIL_INT_RAW_REG (DR_REG_CACHE_BASE + 0x170)
/** CACHE_L1_ICACHE2_FAIL_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  The raw bit of the interrupt of access fail that occurs in L1-ICache2.
 */
#define CACHE_L1_ICACHE2_FAIL_INT_RAW    (BIT(2))
#define CACHE_L1_ICACHE2_FAIL_INT_RAW_M  (CACHE_L1_ICACHE2_FAIL_INT_RAW_V << CACHE_L1_ICACHE2_FAIL_INT_RAW_S)
#define CACHE_L1_ICACHE2_FAIL_INT_RAW_V  0x00000001U
#define CACHE_L1_ICACHE2_FAIL_INT_RAW_S  2
/** CACHE_L1_CACHE_FAIL_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  The raw bit of the interrupt of access fail that occurs in L1-DCache.
 */
#define CACHE_L1_CACHE_FAIL_INT_RAW    (BIT(4))
#define CACHE_L1_CACHE_FAIL_INT_RAW_M  (CACHE_L1_CACHE_FAIL_INT_RAW_V << CACHE_L1_CACHE_FAIL_INT_RAW_S)
#define CACHE_L1_CACHE_FAIL_INT_RAW_V  0x00000001U
#define CACHE_L1_CACHE_FAIL_INT_RAW_S  4

/** CACHE_L1_CACHE_ACS_FAIL_INT_ST_REG register
 *  Cache Access Fail Interrupt status register
 */
#define CACHE_L1_CACHE_ACS_FAIL_INT_ST_REG (DR_REG_CACHE_BASE + 0x174)
/** CACHE_L1_ICACHE2_FAIL_INT_ST : RO; bitpos: [2]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_FAIL_INT_ST    (BIT(2))
#define CACHE_L1_ICACHE2_FAIL_INT_ST_M  (CACHE_L1_ICACHE2_FAIL_INT_ST_V << CACHE_L1_ICACHE2_FAIL_INT_ST_S)
#define CACHE_L1_ICACHE2_FAIL_INT_ST_V  0x00000001U
#define CACHE_L1_ICACHE2_FAIL_INT_ST_S  2
/** CACHE_L1_CACHE_FAIL_INT_ST : RO; bitpos: [4]; default: 0;
 *  The bit indicates the interrupt status of access fail that occurs in L1-DCache due
 *  to cpu accesses L1-DCache.
 */
#define CACHE_L1_CACHE_FAIL_INT_ST    (BIT(4))
#define CACHE_L1_CACHE_FAIL_INT_ST_M  (CACHE_L1_CACHE_FAIL_INT_ST_V << CACHE_L1_CACHE_FAIL_INT_ST_S)
#define CACHE_L1_CACHE_FAIL_INT_ST_V  0x00000001U
#define CACHE_L1_CACHE_FAIL_INT_ST_S  4

/** CACHE_L1_CACHE_ACS_CNT_CTRL_REG register
 *  Cache Access Counter enable and clear register
 */
#define CACHE_L1_CACHE_ACS_CNT_CTRL_REG (DR_REG_CACHE_BASE + 0x178)
/** CACHE_L1_IBUS2_CNT_ENA : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define CACHE_L1_IBUS2_CNT_ENA    (BIT(2))
#define CACHE_L1_IBUS2_CNT_ENA_M  (CACHE_L1_IBUS2_CNT_ENA_V << CACHE_L1_IBUS2_CNT_ENA_S)
#define CACHE_L1_IBUS2_CNT_ENA_V  0x00000001U
#define CACHE_L1_IBUS2_CNT_ENA_S  2
/** CACHE_L1_IBUS3_CNT_ENA : R/W; bitpos: [3]; default: 0;
 *  Reserved
 */
#define CACHE_L1_IBUS3_CNT_ENA    (BIT(3))
#define CACHE_L1_IBUS3_CNT_ENA_M  (CACHE_L1_IBUS3_CNT_ENA_V << CACHE_L1_IBUS3_CNT_ENA_S)
#define CACHE_L1_IBUS3_CNT_ENA_V  0x00000001U
#define CACHE_L1_IBUS3_CNT_ENA_S  3
/** CACHE_L1_BUS0_CNT_ENA : R/W; bitpos: [4]; default: 0;
 *  The bit is used to enable dbus0 counter in L1-DCache.
 */
#define CACHE_L1_BUS0_CNT_ENA    (BIT(4))
#define CACHE_L1_BUS0_CNT_ENA_M  (CACHE_L1_BUS0_CNT_ENA_V << CACHE_L1_BUS0_CNT_ENA_S)
#define CACHE_L1_BUS0_CNT_ENA_V  0x00000001U
#define CACHE_L1_BUS0_CNT_ENA_S  4
/** CACHE_L1_BUS1_CNT_ENA : R/W; bitpos: [5]; default: 0;
 *  The bit is used to enable dbus1 counter in L1-DCache.
 */
#define CACHE_L1_BUS1_CNT_ENA    (BIT(5))
#define CACHE_L1_BUS1_CNT_ENA_M  (CACHE_L1_BUS1_CNT_ENA_V << CACHE_L1_BUS1_CNT_ENA_S)
#define CACHE_L1_BUS1_CNT_ENA_V  0x00000001U
#define CACHE_L1_BUS1_CNT_ENA_S  5
/** CACHE_L1_IBUS2_CNT_CLR : WT; bitpos: [18]; default: 0;
 *  Reserved
 */
#define CACHE_L1_IBUS2_CNT_CLR    (BIT(18))
#define CACHE_L1_IBUS2_CNT_CLR_M  (CACHE_L1_IBUS2_CNT_CLR_V << CACHE_L1_IBUS2_CNT_CLR_S)
#define CACHE_L1_IBUS2_CNT_CLR_V  0x00000001U
#define CACHE_L1_IBUS2_CNT_CLR_S  18
/** CACHE_L1_IBUS3_CNT_CLR : WT; bitpos: [19]; default: 0;
 *  Reserved
 */
#define CACHE_L1_IBUS3_CNT_CLR    (BIT(19))
#define CACHE_L1_IBUS3_CNT_CLR_M  (CACHE_L1_IBUS3_CNT_CLR_V << CACHE_L1_IBUS3_CNT_CLR_S)
#define CACHE_L1_IBUS3_CNT_CLR_V  0x00000001U
#define CACHE_L1_IBUS3_CNT_CLR_S  19
/** CACHE_L1_BUS0_CNT_CLR : WT; bitpos: [20]; default: 0;
 *  The bit is used to clear dbus0 counter in L1-DCache.
 */
#define CACHE_L1_BUS0_CNT_CLR    (BIT(20))
#define CACHE_L1_BUS0_CNT_CLR_M  (CACHE_L1_BUS0_CNT_CLR_V << CACHE_L1_BUS0_CNT_CLR_S)
#define CACHE_L1_BUS0_CNT_CLR_V  0x00000001U
#define CACHE_L1_BUS0_CNT_CLR_S  20
/** CACHE_L1_BUS1_CNT_CLR : WT; bitpos: [21]; default: 0;
 *  The bit is used to clear dbus1 counter in L1-DCache.
 */
#define CACHE_L1_BUS1_CNT_CLR    (BIT(21))
#define CACHE_L1_BUS1_CNT_CLR_M  (CACHE_L1_BUS1_CNT_CLR_V << CACHE_L1_BUS1_CNT_CLR_S)
#define CACHE_L1_BUS1_CNT_CLR_V  0x00000001U
#define CACHE_L1_BUS1_CNT_CLR_S  21

/** CACHE_L1_IBUS2_ACS_HIT_CNT_REG register
 *  L1-ICache bus2 Hit-Access Counter register
 */
#define CACHE_L1_IBUS2_ACS_HIT_CNT_REG (DR_REG_CACHE_BASE + 0x19c)
/** CACHE_L1_IBUS2_HIT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of hits when bus2 accesses L1-ICache2.
 */
#define CACHE_L1_IBUS2_HIT_CNT    0xFFFFFFFFU
#define CACHE_L1_IBUS2_HIT_CNT_M  (CACHE_L1_IBUS2_HIT_CNT_V << CACHE_L1_IBUS2_HIT_CNT_S)
#define CACHE_L1_IBUS2_HIT_CNT_V  0xFFFFFFFFU
#define CACHE_L1_IBUS2_HIT_CNT_S  0

/** CACHE_L1_IBUS2_ACS_MISS_CNT_REG register
 *  L1-ICache bus2 Miss-Access Counter register
 */
#define CACHE_L1_IBUS2_ACS_MISS_CNT_REG (DR_REG_CACHE_BASE + 0x1a0)
/** CACHE_L1_IBUS2_MISS_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of missing when bus2 accesses L1-ICache2.
 */
#define CACHE_L1_IBUS2_MISS_CNT    0xFFFFFFFFU
#define CACHE_L1_IBUS2_MISS_CNT_M  (CACHE_L1_IBUS2_MISS_CNT_V << CACHE_L1_IBUS2_MISS_CNT_S)
#define CACHE_L1_IBUS2_MISS_CNT_V  0xFFFFFFFFU
#define CACHE_L1_IBUS2_MISS_CNT_S  0

/** CACHE_L1_IBUS2_ACS_CONFLICT_CNT_REG register
 *  L1-ICache bus2 Conflict-Access Counter register
 */
#define CACHE_L1_IBUS2_ACS_CONFLICT_CNT_REG (DR_REG_CACHE_BASE + 0x1a4)
/** CACHE_L1_IBUS2_CONFLICT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of access-conflicts when bus2 accesses L1-ICache2.
 */
#define CACHE_L1_IBUS2_CONFLICT_CNT    0xFFFFFFFFU
#define CACHE_L1_IBUS2_CONFLICT_CNT_M  (CACHE_L1_IBUS2_CONFLICT_CNT_V << CACHE_L1_IBUS2_CONFLICT_CNT_S)
#define CACHE_L1_IBUS2_CONFLICT_CNT_V  0xFFFFFFFFU
#define CACHE_L1_IBUS2_CONFLICT_CNT_S  0

/** CACHE_L1_IBUS2_ACS_NXTLVL_RD_CNT_REG register
 *  L1-ICache bus2 Next-Level-Access Counter register
 */
#define CACHE_L1_IBUS2_ACS_NXTLVL_RD_CNT_REG (DR_REG_CACHE_BASE + 0x1a8)
/** CACHE_L1_IBUS2_NXTLVL_RD_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of times that L1-ICache accesses L2-Cache due to
 *  bus2 accessing L1-ICache2.
 */
#define CACHE_L1_IBUS2_NXTLVL_RD_CNT    0xFFFFFFFFU
#define CACHE_L1_IBUS2_NXTLVL_RD_CNT_M  (CACHE_L1_IBUS2_NXTLVL_RD_CNT_V << CACHE_L1_IBUS2_NXTLVL_RD_CNT_S)
#define CACHE_L1_IBUS2_NXTLVL_RD_CNT_V  0xFFFFFFFFU
#define CACHE_L1_IBUS2_NXTLVL_RD_CNT_S  0

/** CACHE_L1_IBUS3_ACS_HIT_CNT_REG register
 *  L1-ICache bus3 Hit-Access Counter register
 */
#define CACHE_L1_IBUS3_ACS_HIT_CNT_REG (DR_REG_CACHE_BASE + 0x1ac)
/** CACHE_L1_IBUS3_HIT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of hits when bus3 accesses L1-ICache3.
 */
#define CACHE_L1_IBUS3_HIT_CNT    0xFFFFFFFFU
#define CACHE_L1_IBUS3_HIT_CNT_M  (CACHE_L1_IBUS3_HIT_CNT_V << CACHE_L1_IBUS3_HIT_CNT_S)
#define CACHE_L1_IBUS3_HIT_CNT_V  0xFFFFFFFFU
#define CACHE_L1_IBUS3_HIT_CNT_S  0

/** CACHE_L1_IBUS3_ACS_MISS_CNT_REG register
 *  L1-ICache bus3 Miss-Access Counter register
 */
#define CACHE_L1_IBUS3_ACS_MISS_CNT_REG (DR_REG_CACHE_BASE + 0x1b0)
/** CACHE_L1_IBUS3_MISS_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of missing when bus3 accesses L1-ICache3.
 */
#define CACHE_L1_IBUS3_MISS_CNT    0xFFFFFFFFU
#define CACHE_L1_IBUS3_MISS_CNT_M  (CACHE_L1_IBUS3_MISS_CNT_V << CACHE_L1_IBUS3_MISS_CNT_S)
#define CACHE_L1_IBUS3_MISS_CNT_V  0xFFFFFFFFU
#define CACHE_L1_IBUS3_MISS_CNT_S  0

/** CACHE_L1_IBUS3_ACS_CONFLICT_CNT_REG register
 *  L1-ICache bus3 Conflict-Access Counter register
 */
#define CACHE_L1_IBUS3_ACS_CONFLICT_CNT_REG (DR_REG_CACHE_BASE + 0x1b4)
/** CACHE_L1_IBUS3_CONFLICT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of access-conflicts when bus3 accesses L1-ICache3.
 */
#define CACHE_L1_IBUS3_CONFLICT_CNT    0xFFFFFFFFU
#define CACHE_L1_IBUS3_CONFLICT_CNT_M  (CACHE_L1_IBUS3_CONFLICT_CNT_V << CACHE_L1_IBUS3_CONFLICT_CNT_S)
#define CACHE_L1_IBUS3_CONFLICT_CNT_V  0xFFFFFFFFU
#define CACHE_L1_IBUS3_CONFLICT_CNT_S  0

/** CACHE_L1_IBUS3_ACS_NXTLVL_RD_CNT_REG register
 *  L1-ICache bus3 Next-Level-Access Counter register
 */
#define CACHE_L1_IBUS3_ACS_NXTLVL_RD_CNT_REG (DR_REG_CACHE_BASE + 0x1b8)
/** CACHE_L1_IBUS3_NXTLVL_RD_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of times that L1-ICache accesses L2-Cache due to
 *  bus3 accessing L1-ICache3.
 */
#define CACHE_L1_IBUS3_NXTLVL_RD_CNT    0xFFFFFFFFU
#define CACHE_L1_IBUS3_NXTLVL_RD_CNT_M  (CACHE_L1_IBUS3_NXTLVL_RD_CNT_V << CACHE_L1_IBUS3_NXTLVL_RD_CNT_S)
#define CACHE_L1_IBUS3_NXTLVL_RD_CNT_V  0xFFFFFFFFU
#define CACHE_L1_IBUS3_NXTLVL_RD_CNT_S  0

